(gdb) l
1	#include<stdio.h>
2	void swap(int *,int *);
3	int main()
4	{
5	        int a,b;
6	        printf("enter a and b:");
7	        scanf("%d%d",&a,&b);
8	        swap(&a,&b);
9	        printf("After swaping:%d %d\n",a,b);
10	        return 0;
(gdb) b main
Breakpoint 1 at 0x722: file 5-callby-ref.c, line 4.
(gdb) i b
Num     Type           Disp Enb Address            What
1       breakpoint     keep y   0x0000000000000722 in main at 5-callby-ref.c:4
(gdb) r
Starting program: /home/km/embedded/gdb/callre 

Breakpoint 1, main () at 5-callby-ref.c:4
4	{
(gdb) n
6	        printf("enter a and b:");
(gdb) n
7	        scanf("%d%d",&a,&b);
(gdb) n
enter a and b:10 20
8	        swap(&a,&b);
(gdb) p a
$1 = 10
(gdb) p b
$2 = 20
(gdb) s
swap (p1=0x7fffffffe0b0, p2=0x7fffffffe0b4) at 5-callby-ref.c:16
16	        t=*p1;
(gdb) n
17	        *p1=*p2;
(gdb) n
18	        *p2=t;
(gdb) p *p1
$3 = 20
(gdb) p *p2
$4 = 20
(gdb) n
19	}
(gdb) n
main () at 5-callby-ref.c:9
9	        printf("After swaping:%d %d\n",a,b);
(gdb) n
After swaping:20 10
10	        return 0;
(gdb) n
11	}

